package com.yhb.news.model;

import java.util.List;

/**
 * Created by Administrator on 2017/11/4.
 */

public class XiaoHuaModel {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":413,"ret_code":0,"contentlist":[{"text":"麻麻来我这，说：\u201c你知道吗，你小时候邻居哥哥的表哥东南大学毕业的，工作了十年现在跳槽到北京，年薪千万。\u201c恩，好的，什么时候见面？\u201d\u201c什么见面？\u201d\u201c你说这么多，不就是想介绍给我么。\u201d\u201c并没有。\u201d麻麻看都不看我一眼，\u201c他是不可能看的上你的。\u201d","title":"还是麻麻拎的清","type":1,"ct":"2017-11-04 18:30:03.294"},{"text":"一天，开奔驰的和骑电瓶车的遇上了，奔驰车：\u201c我车价值几百万。\u201d 电瓶车：\u201c我敢闯红灯。\u201d 奔驰车：我速度比你快。\u201d 电瓶车：我敢闯红灯。\u201d 奔驰车：我的车可以车震。\u201d 电瓶车：我红灯。\u201d 奔驰：\u201c咱能不提闯红灯不？\u201d 电瓶车：\u201c我敢逆行。。。\u201d","title":"开奔驰的和骑电瓶车的","type":1,"ct":"2017-11-04 18:30:03.291"},{"text":"一次我问闺蜜：什么是真爱呢？ 闺蜜说：比如吧，如果我裸体在一个男人面前，而他第一关心的是我会不会受冷感冒，这便是真爱。 我嘟嘟嘴：那你该有多丑。","title":"什么是真爱呢？","type":1,"ct":"2017-11-04 18:30:03.289"},{"text":"男生们应该明白：大部分女生看宁泽涛的游泳比赛，相等于你们看林志玲洗澡，而且是实况转播，而且洗完以后还湿漉漉地接受采访\u2026\u2026","title":"这就是女生爱看跳水的原因","type":1,"ct":"2017-11-04 18:30:03.282"},{"text":"小时偷看电视，老爸回来总能发现蛛丝马迹，把我胖揍一顿。 发现的方法有：1。频道不对，音量不对； 2。电视有余温，坐的地方有余温； 3。屏幕有静电； 4罩电视机的布摆放不对","title":"知识点","type":1,"ct":"2017-11-04 18:30:03.147"},{"text":"去邻居家借东西，他们家在吃西瓜，当他把东西借给我时，我却说：我不吃...当时丢的脸现在还没找到。","title":"场面一度很尴尬","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"看到一个老爷爷提着很重的东西上楼，本想说：爷爷我帮你拿东西吧！张口变成了：老东西爷爷我帮你拿！","title":"爷爷我帮你拿东西吧","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"\u201c你压着我头发了。\u201d夜半时分，僧人耳边传来一句女子的声音，被吓得无法动弹。他明明记得，他睡的是个尼姑。","title":"真是鬼故事","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"世界上最遥远的距离不是天涯和海角，而是你牙缝里有东西卡着，舌头知道它在哪，但你的手却怎么也摸不到。 ","title":"世界上最遥远的距离","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"同事处对象，多方打听知道对象老爸喜欢铁观音，就找铸造厂的朋友，连夜给她爸浇了一尊一米多高的，十个人给她爸送家去了，结果被轰了出来。。。","title":"没猫饼啊。。。","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"【网络型迟钝性人格】特征：1、人家用4G，ta还是用E网 2、手机卡到不行也不去刷机 3、能心平浪静的面对\u201c加载中\u2026\u201d \u201c已下载99%\u201d \u201c信号弱\u201d 4、看到信息永远不会秒回 5、能忍受几k/s 的网速 6、经常找代购或者海淘，有耐心等几个月，从不关心物流信息 7、多发于中老年人群 ","title":"网络型迟钝性人格","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"洗手时看见学校食堂师傅炒菜时挖鼻孔手都不洗就继续炒菜，向校长报告，校长说严肃处理，但是的没想到第二天挂了个闲人免进的牌子。","title":"必须严肃处理啊","type":1,"ct":"2017-11-04 16:30:03.145"},{"text":"一个秀才路过一村庄，看见狗主人正在磨刀准备杀一条无毛犬，秀才看无毛犬可怜，就求情：既然你不养了，那我买了放生吧。无毛犬主人不同意，两个人争了起来。一旁的无毛犬看秀才不尊重它的主人就呲牙咧嘴扑上来咬秀才，无毛犬主人说：看见没，我要杀它它却忠成我，你要救它它却要咬你，这就是畜牲！","title":"狗：有句MMP不知道当讲不当讲","type":1,"ct":"2017-11-04 16:30:03.144"},{"text":"好朋友就像是星星，你不一定经常能看到他们，但你知道，只要你一抬头，他们永远在那里远远地看着你，啥用没有。","title":"好朋友就像是星星","type":1,"ct":"2017-11-04 16:30:03.141"},{"text":"今天终于约到了心爱的姑娘，吃完饭后到宾馆房间。望着满脸羞涩的她，我迫不及待的抱她上了床。各种扶摸，浑身的激情，正待翻身上马，拔枪射击的时候，子弹飕的射在了裤子里面。我翻身而过，悠悠的点上一根烟，望着她那渴望的眼神，我淡淡的说:\u201c我是好人，我真不想伤害你。\u201d","title":"我是个好人","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"小时候买方便面，先捏碎，再把调味包撒进去，使劲摇，然后吃，吃的剩下最后一点全倒手里，然后左右手倒来倒去，把多余的调味粉抖掉，觉得差不多了就一把扣嘴里，再把手舔干净。多么美好的回忆。","title":"我现在也这样吃","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"青年失恋了，低着头悲伤地哭泣。禅师安慰道：「你只不过失去了一个不爱你的人，他却失去了一个深爱他的人。」 女青年抬头擦干泪水：「所以我是幸运的，他才是不幸的，对吗？」禅师一脸愁容：「其实我也没什么恋爱经验，但师太抢走道长的那一晚，我在捧腹看到了这句话，觉得说得挺好的。」 ","title":"来自禅师的安慰","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"当参观一个世界奇迹时，你最想了解哪些信息？答：这附近有好吃的吗？","title":"没毛病","type":1,"ct":"2017-11-04 16:30:03.130"},{"text":"看到一哥们儿问【如何杀死Q宠？】，他说：【Q宠可他吗烦了啊！从我初中开始，它就开始感冒，一直没治，结果老子大学都该毕业了它还没死。怎么才能让它死啊？！】","title":"如何杀死Q宠","type":1,"ct":"2017-11-04 16:30:03.113"},{"text":"作业妩媚地躺在床上，风骚地卖弄自己，咬着嘴唇用她性感的声音轻轻说道：\u201c你怎么还不来啊，这都快一个月了你都不来宠爱人家，好寂寞的啦！\u201d\u201c哼，这就耐不住了吗？\u201d我冲她微微一笑，凑上去抚摸着她，说\u201c最后三天让你知道我的厉害！\u201d","title":"最后三天让你知道我的厉害","type":1,"ct":"2017-11-04 16:30:03.112"}],"currentPage":1,"allNum":8246,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 413
         * ret_code : 0
         * contentlist : [{"text":"麻麻来我这，说：\u201c你知道吗，你小时候邻居哥哥的表哥东南大学毕业的，工作了十年现在跳槽到北京，年薪千万。\u201c恩，好的，什么时候见面？\u201d\u201c什么见面？\u201d\u201c你说这么多，不就是想介绍给我么。\u201d\u201c并没有。\u201d麻麻看都不看我一眼，\u201c他是不可能看的上你的。\u201d","title":"还是麻麻拎的清","type":1,"ct":"2017-11-04 18:30:03.294"},{"text":"一天，开奔驰的和骑电瓶车的遇上了，奔驰车：\u201c我车价值几百万。\u201d 电瓶车：\u201c我敢闯红灯。\u201d 奔驰车：我速度比你快。\u201d 电瓶车：我敢闯红灯。\u201d 奔驰车：我的车可以车震。\u201d 电瓶车：我红灯。\u201d 奔驰：\u201c咱能不提闯红灯不？\u201d 电瓶车：\u201c我敢逆行。。。\u201d","title":"开奔驰的和骑电瓶车的","type":1,"ct":"2017-11-04 18:30:03.291"},{"text":"一次我问闺蜜：什么是真爱呢？ 闺蜜说：比如吧，如果我裸体在一个男人面前，而他第一关心的是我会不会受冷感冒，这便是真爱。 我嘟嘟嘴：那你该有多丑。","title":"什么是真爱呢？","type":1,"ct":"2017-11-04 18:30:03.289"},{"text":"男生们应该明白：大部分女生看宁泽涛的游泳比赛，相等于你们看林志玲洗澡，而且是实况转播，而且洗完以后还湿漉漉地接受采访\u2026\u2026","title":"这就是女生爱看跳水的原因","type":1,"ct":"2017-11-04 18:30:03.282"},{"text":"小时偷看电视，老爸回来总能发现蛛丝马迹，把我胖揍一顿。 发现的方法有：1。频道不对，音量不对； 2。电视有余温，坐的地方有余温； 3。屏幕有静电； 4罩电视机的布摆放不对","title":"知识点","type":1,"ct":"2017-11-04 18:30:03.147"},{"text":"去邻居家借东西，他们家在吃西瓜，当他把东西借给我时，我却说：我不吃...当时丢的脸现在还没找到。","title":"场面一度很尴尬","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"看到一个老爷爷提着很重的东西上楼，本想说：爷爷我帮你拿东西吧！张口变成了：老东西爷爷我帮你拿！","title":"爷爷我帮你拿东西吧","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"\u201c你压着我头发了。\u201d夜半时分，僧人耳边传来一句女子的声音，被吓得无法动弹。他明明记得，他睡的是个尼姑。","title":"真是鬼故事","type":1,"ct":"2017-11-04 18:00:10.513"},{"text":"世界上最遥远的距离不是天涯和海角，而是你牙缝里有东西卡着，舌头知道它在哪，但你的手却怎么也摸不到。 ","title":"世界上最遥远的距离","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"同事处对象，多方打听知道对象老爸喜欢铁观音，就找铸造厂的朋友，连夜给她爸浇了一尊一米多高的，十个人给她爸送家去了，结果被轰了出来。。。","title":"没猫饼啊。。。","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"【网络型迟钝性人格】特征：1、人家用4G，ta还是用E网 2、手机卡到不行也不去刷机 3、能心平浪静的面对\u201c加载中\u2026\u201d \u201c已下载99%\u201d \u201c信号弱\u201d 4、看到信息永远不会秒回 5、能忍受几k/s 的网速 6、经常找代购或者海淘，有耐心等几个月，从不关心物流信息 7、多发于中老年人群 ","title":"网络型迟钝性人格","type":1,"ct":"2017-11-04 18:00:10.512"},{"text":"洗手时看见学校食堂师傅炒菜时挖鼻孔手都不洗就继续炒菜，向校长报告，校长说严肃处理，但是的没想到第二天挂了个闲人免进的牌子。","title":"必须严肃处理啊","type":1,"ct":"2017-11-04 16:30:03.145"},{"text":"一个秀才路过一村庄，看见狗主人正在磨刀准备杀一条无毛犬，秀才看无毛犬可怜，就求情：既然你不养了，那我买了放生吧。无毛犬主人不同意，两个人争了起来。一旁的无毛犬看秀才不尊重它的主人就呲牙咧嘴扑上来咬秀才，无毛犬主人说：看见没，我要杀它它却忠成我，你要救它它却要咬你，这就是畜牲！","title":"狗：有句MMP不知道当讲不当讲","type":1,"ct":"2017-11-04 16:30:03.144"},{"text":"好朋友就像是星星，你不一定经常能看到他们，但你知道，只要你一抬头，他们永远在那里远远地看着你，啥用没有。","title":"好朋友就像是星星","type":1,"ct":"2017-11-04 16:30:03.141"},{"text":"今天终于约到了心爱的姑娘，吃完饭后到宾馆房间。望着满脸羞涩的她，我迫不及待的抱她上了床。各种扶摸，浑身的激情，正待翻身上马，拔枪射击的时候，子弹飕的射在了裤子里面。我翻身而过，悠悠的点上一根烟，望着她那渴望的眼神，我淡淡的说:\u201c我是好人，我真不想伤害你。\u201d","title":"我是个好人","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"小时候买方便面，先捏碎，再把调味包撒进去，使劲摇，然后吃，吃的剩下最后一点全倒手里，然后左右手倒来倒去，把多余的调味粉抖掉，觉得差不多了就一把扣嘴里，再把手舔干净。多么美好的回忆。","title":"我现在也这样吃","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"青年失恋了，低着头悲伤地哭泣。禅师安慰道：「你只不过失去了一个不爱你的人，他却失去了一个深爱他的人。」 女青年抬头擦干泪水：「所以我是幸运的，他才是不幸的，对吗？」禅师一脸愁容：「其实我也没什么恋爱经验，但师太抢走道长的那一晚，我在捧腹看到了这句话，觉得说得挺好的。」 ","title":"来自禅师的安慰","type":1,"ct":"2017-11-04 16:30:03.133"},{"text":"当参观一个世界奇迹时，你最想了解哪些信息？答：这附近有好吃的吗？","title":"没毛病","type":1,"ct":"2017-11-04 16:30:03.130"},{"text":"看到一哥们儿问【如何杀死Q宠？】，他说：【Q宠可他吗烦了啊！从我初中开始，它就开始感冒，一直没治，结果老子大学都该毕业了它还没死。怎么才能让它死啊？！】","title":"如何杀死Q宠","type":1,"ct":"2017-11-04 16:30:03.113"},{"text":"作业妩媚地躺在床上，风骚地卖弄自己，咬着嘴唇用她性感的声音轻轻说道：\u201c你怎么还不来啊，这都快一个月了你都不来宠爱人家，好寂寞的啦！\u201d\u201c哼，这就耐不住了吗？\u201d我冲她微微一笑，凑上去抚摸着她，说\u201c最后三天让你知道我的厉害！\u201d","title":"最后三天让你知道我的厉害","type":1,"ct":"2017-11-04 16:30:03.112"}]
         * currentPage : 1
         * allNum : 8246
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * text : 麻麻来我这，说：“你知道吗，你小时候邻居哥哥的表哥东南大学毕业的，工作了十年现在跳槽到北京，年薪千万。“恩，好的，什么时候见面？”“什么见面？”“你说这么多，不就是想介绍给我么。”“并没有。”麻麻看都不看我一眼，“他是不可能看的上你的。”
             * title : 还是麻麻拎的清
             * type : 1
             * ct : 2017-11-04 18:30:03.294
             */

            private String text;
            private String title;
            private String ct;

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
